{
  "base_model_name_or_path": "/root/fan.yang/model/chatglm2/",
  "bias": "none",
  "enable_lora": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "merge_weights": false,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "dense_h_to_4h",
    "dense_4h_to_h",
    "query_key_value"
  ],
  "task_type": "CAUSAL_LM"
}